.config/emacs/config.org
#+title: GNU Emacs Configuration
#+auto_tangle: t

* Table of Contents :toc:noexport:
- [[#info-and-credits][INFO and CREDITS]]
- [[#early-init][Early Init]]
- [[#the-rest][The rest]]
  - [[#sane-defaults-and-other][Sane defaults (and other)]]
    - [[#termux-check][Termux check]]
    - [[#some-modes-turned-on-and-off][Some modes turned on and off]]
    - [[#uncluttering-user-emacs-directory][Uncluttering user-emacs-directory]]
    - [[#native-compilation][Native compilation]]
    - [[#other-variables][Other variables]]
    - [[#other][Other]]
    - [[#package-management-setup][Package management setup]]
      - [[#normal-packages][Normal packages]]
      - [[#not-normal-packages-vc][Not normal packages (vc)]]
  - [[#gcmh][GCMH]]
  - [[#keybindings][Keybindings]]
    - [[#modal-editing-meow][Modal editing (Meow)]]
    - [[#flashing][Flashing]]
    - [[#setting-keybindings][Setting keybindings]]
  - [[#built-in-packages][Built-in packages]]
    - [[#abbreviations][Abbreviations]]
    - [[#recentf---file-history][recentf - file history]]
    - [[#remembering-file-place][Remembering file place]]
    - [[#eww][EWW]]
    - [[#line-numbers][Line numbers]]
    - [[#project-management][Project management]]
    - [[#tabs][Tabs]]
    - [[#ibuffer][Ibuffer]]
  - [[#appearance][Appearance]]
    - [[#dashboard-enlight][Dashboard (enlight)]]
    - [[#fonts][Fonts]]
      - [[#setting-fonts][Setting fonts]]
      - [[#enabling-programming-ligatures][Enabling programming ligatures]]
    - [[#highlight-todo][Highlight TODO]]
    - [[#icons-nerd-fonts][Icons (Nerd Fonts)]]
    - [[#modeline][Modeline]]
    - [[#rainbow-delimiters][Rainbow delimiters]]
    - [[#display-color-codes][Display color codes]]
    - [[#theme-ewal][Theme (ewal)]]
  - [[#completion][Completion]]
    - [[#in-buffer-completion][In-buffer completion]]
      - [[#corfu][corfu]]
      - [[#cape][cape]]
      - [[#completion-preview-mode][completion-preview-mode]]
    - [[#minibuffer-completion][Minibuffer completion]]
      - [[#vertico][Vertico]]
      - [[#consult][Consult]]
      - [[#annotations-marginalia][Annotations (marginalia)]]
  - [[#dired][Dired]]
  - [[#docs][Docs]]
    - [[#helpful][Helpful]]
      - [[#meows-describe-key-override][Meow's describe-key override]]
    - [[#which-key][Which-key]]
  - [[#elfeed][Elfeed]]
  - [[#embark][Embark]]
  - [[#magit][Magit]]
  - [[#transient][Transient]]
  - [[#org-mode][Org Mode]]
    - [[#initial-tweaks][Initial tweaks]]
    - [[#following-links-in-a-table][Following links in a table]]
    - [[#dwim-inserting-behaviour][DWIM inserting behaviour]]
    - [[#agenda-settings][Agenda settings]]
    - [[#saving-agenda-files][Saving agenda files]]
    - [[#export-settings][Export settings]]
    - [[#latex-settings][LaTeX settings]]
    - [[#meow-settings][Meow settings]]
    - [[#org-tempo][Org Tempo]]
    - [[#org-appear][Org appear]]
    - [[#org-auto-tangle][Org auto tangle]]
    - [[#org-roam][Org Roam]]
    - [[#toc][TOC]]
  - [[#parenthesis][Parenthesis]]
  - [[#programming][Programming]]
    - [[#compiling][Compiling]]
    - [[#flycheck][Flycheck]]
    - [[#lsp][LSP]]
    - [[#language-support][Language support]]
    - [[#languages][Languages]]
      - [[#shells][Shells]]
      - [[#c][C++]]
      - [[#lisp][Lisp]]
      - [[#elisp][Elisp]]
      - [[#python][Python]]
      - [[#web][Web]]
        - [[#impatient-mode][Impatient mode]]
        - [[#html][HTML]]
        - [[#css][CSS]]
        - [[#js][JS]]
    - [[#tree-sitter][Tree-sitter]]
    - [[#templates][Templates]]
      - [[#startup-templates-auto-insert][Startup templates (auto-insert)]]
      - [[#command-templates][Command templates]]
    - [[#making-file-executable-if-its-a-script][Making file executable if it's a script]]
    - [[#highlighting-fill-column][Highlighting =fill-column=]]
  - [[#shells-and-terminals][Shells and terminals]]
    - [[#shell][Shell]]
    - [[#eshell][Eshell]]
      - [[#eat][EAT]]
    - [[#vterm][Vterm]]
  - [[#sudo-edit][Sudo edit]]
  - [[#translation-reverso][Translation (reverso)]]
  - [[#writeroom][Writeroom]]
  - [[#display-buffer-alist][display-buffer-alist]]
  - [[#pop-up-windows][Pop up windows]]
  - [[#m3u-mode][M3U mode]]
  - [[#local-packages][Local packages]]
  - [[#anilist-activity-lookup][Anilist activity lookup]]
  - [[#ace-window][ace-window]]

* INFO and CREDITS
Credits to:
- DistroTube with his [[https://youtube.com/playlist?list=PL5--8gKSku15e8lXf7aLICFmAHQVo0KXX][Emacs Configuration videos]]
- System Crafters with his Emacs from Scratch [[https://youtube.com/playlist?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ][videos]] and [[https://systemcrafters.net/emacs-from-scratch/][web articles]]
- [[https://sachachua.com/blog/][Sacha Chua]] for giving sum of Emacs news and content per week

This config is used on Emacs _30.1_ and is intended for use with that version.
* Early Init
#+begin_src emacs-lisp :tangle early-init.el
(setq frame-inhibit-implied-resize t ;; that makes startup slightly faster
      auto-mode-case-fold nil
      package-native-compile t
      default-directory "~/"
      use-package-enable-imenu-support t)

;; improving startup with setting garbage collection
;; https://codeberg.org/zyd/dotfiles/src/commit/e2deef9551ec259e62e19abe3a9b86feb4a5c870/emacs.d/early-init.el
(let ((default-gc-threshold gc-cons-threshold)
      (default-gc-percentage gc-cons-percentage))
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.8)
  (add-hook 'after-init-hook
            `(lambda ()
               (setq gc-cons-percentage ,default-gc-percentage
                     gc-cons-threshold ,default-gc-threshold))
            100)) ; add to the end of the list

;; also improves startup time
(let ((old-list file-name-handler-alist))
  (setq file-name-handler-alist nil)
  (add-hook 'after-init-hook
            `(lambda ()
               (setq file-name-handler-alist ',old-list))
            100))

;; Faster to disable these here (before they've been initialized)
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(push '(horizontal-scroll-bars) default-frame-alist)
#+end_src
* The rest
#+PROPERTY: header-args :tangle init.el
** Sane defaults (and other)
Here are some tweaks that idk where to put.
*** Termux check
I'll disable some stuff for Termux specifically so I create a variable that checks if I'm on Termux.
#+begin_src emacs-lisp
(defvar on-termux-p (and (getenv "TERMUX_VERSION"))
  "Checks if Emacs is running inside of Termux.")
#+end_src
*** Some modes turned on and off
Those =fbound= are because Termux Emacs doesn't have some functions at all and that spitted out errors.
#+begin_src emacs-lisp
(unless on-termux-p
  (if (fboundp 'scroll-bar-mode)
      (scroll-bar-mode -1)))         ; Disable visible scrollbar
(unless on-termux-p
  (if (fboundp 'tool-bar-mode)
      (tool-bar-mode -1)))           ; Disable the toolbar
(unless on-termux-p
  (if (fboundp 'set-fringe-mode)
      (set-fringe-mode 10)))         ; Give some breathing room
(tooltip-mode -1)                    ; Disable tooltips
(menu-bar-mode -1)                   ; Disable the menu bar
(global-auto-revert-mode t)          ; Automatically show changes if the file has changed
(global-visual-line-mode t)          ; Enable truncated lines (line wrapping)
(delete-selection-mode 1)            ; You can select text and delete it by typing (in emacs keybindings).
(electric-pair-mode 1)               ; Turns on automatic parens pairing
(electric-indent-mode -1)            ; Turns off the weird default indenting.
(column-number-mode 1)               ; Column number in modeline
(display-battery-mode 1)             ; Setting battery percentage in modeline
#+end_src
*** Uncluttering user-emacs-directory
#+begin_src emacs-lisp
(require 'xdg)

(defvar user-share-emacs-directory
  (expand-file-name "emacs" (xdg-data-home))
  "Directory to redirect cache/dump files.
Elisp packages cache folders/files normally clutter
`user-emacs-directory'. The same goes for some default files like
bookmarks file. In order to prevent that this variable exists.
Most of the stuff will get redirected here.")

(defun expand-file-name-user-share (file)
  "Expand a FILE to `user-share-emacs-directory'."
  (expand-file-name file user-share-emacs-directory))

(setq-default
 bookmark-default-file
 (expand-file-name-user-share "bookmarks")
 auto-save-list-file-prefix
 (expand-file-name-user-share "auto-save-list/.saves-")
 ;; custom settings that emacs autosets
 custom-file
 (expand-file-name-user-share "custom.el")
 ;; moving backup files to trash directory
 backup-directory-alist '((".*" . "~/.local/share/Trash/files"))
 tramp-persistency-file-name
 (expand-file-name-user-share "tramp")
 save-place-file
 (expand-file-name-user-share "places")
 ;; cache from urls (eww)
 url-configuration-directory
 (expand-file-name-user-share "url")
 multisession-directory
 (expand-file-name-user-share "multisession")
 request-storage-directory
 (expand-file-name-user-share "request")
 ielm-history-file-name
 (expand-file-name-user-share "ielm-history.eld"))
#+end_src
*** Native compilation
From [[https://www.rahuljuliato.com/posts/multiple-eln-cache][this blog post]].
#+begin_src emacs-lisp
(when (and (featurep 'native-compile)
           package-native-compile)
  ;; Set the right directory to store the native compilation cache
  (let ((path (expand-file-name-user-share "eln-cache/")))
    (startup-redirect-eln-cache path))
  (setq native-comp-async-report-warnings-errors nil)
  ;; Silence compiler warnings as they can be disruptive
  ;; (setq-default native-comp-async-report-warnings-errors nil)
  )
#+end_src
*** Other variables
#+begin_src emacs-lisp
(setq-default global-auto-revert-non-file-buffers t ; refreshing buffers without file associated with them
              use-dialog-box nil ; turns off graphical dialog boxes
              use-file-dialog nil
              initial-buffer-choice t ; scratch buffer as a startup buffer
              initial-major-mode 'fundamental-mode ; setting scratch buffer major mode
              ;; initial-scratch-message nil ; scratch buffer message
              inhibit-startup-message nil ; default emacs startup message
              vc-follow-symlinks t ; follow symlinks
              indent-tabs-mode nil ; use spaces instead of tabs for indenting
              tab-width 4 ; it's set by default to 8
              standard-indent 2 ; indenting set to 2
              auto-revert-interval 1
              use-short-answers t ; replace yes-no prompts with y-n
              fast-but-imprecise-scrolling t ; fast scrolling
              inhibit-compacting-font-caches t
              sentence-end-double-space nil ; sentences end with 1 space
              create-lockfiles nil ; no files with ".#"
              make-backup-files nil
              require-final-newline t
              show-paren-when-point-inside-paren t
              show-paren-when-point-in-periphery t
              truncate-string-ellipsis "…"
              uniquify-buffer-name-style 'forward
              kill-buffer-delete-auto-save-files t
              frame-resize-pixelwise t
              hscroll-margin 2
              hscroll-step 1
              scroll-conservatively 10
              scroll-margin 0
              scroll-preserve-screen-position t
              auto-window-vscroll nil
              mouse-wheel-scroll-amount '(1 ((shift) . hscroll))
              mouse-wheel-scroll-amount-horizontal 1
              kill-do-not-save-duplicates nil
              comment-empty-lines t
              url-privacy-level 'paranoid
              electric-pair-skip-self nil
              history-length t
              kill-do-not-save-duplicates t
              scroll-error-top-bottom t
              enable-local-variables :all
              save-interprogram-paste-before-kill t
              shell-command-prompt-show-cwd t
              fill-column 72)

;; showing init time in scratch buffer
(if on-termux-p
    (add-hook
     'after-init-hook
     (lambda ()
       (setq initial-scratch-message
             (concat "Initialization time: " (emacs-init-time)))))
  (setq initial-scratch-message nil))

;; this opens links in android's default apps in termux
(if on-termux-p
    (setq browse-url-browser-function 'browse-url-xdg-open))
#+end_src
